apps/backend/load-test/load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 50
      name: "Sustained load"
    - duration: 60
      arrivalRate: 100
      name: "Peak load"
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: "Health check"
    flow:
      - get:
          url: "/api/health"

  - name: "Get servers"
    flow:
      - get:
          url: "/api/servers"

  - name: "Get plans"
    flow:
      - get:
          url: "/api/plans"

  - name: "User flow"
    flow:
      - post:
          url: "/api/auth/register"
          json:
            email: "loadtest-{{ $randomNumber() }}@example.com"
            password: "LoadTest123!"
            firstName: "Load"
            lastName: "Test"
          capture:
            - json: "$.accessToken"
              as: "token"
      - get:
          url: "/api/servers"
          headers:
            Authorization: "Bearer {{ token }}"
      - post:
          url: "/api/vpn/config/generate"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            serverId: "server-1"
            protocol: "WIREGUARD"